app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `password_digest`) VALUES ('Manh', 'n-manh@ruby-dev.jp', '2019-03-06 03:52:32', '2019-03-06 03:52:32', '$2a$10$o84UEiikZjGvU42ClF8hOOCTumo4BRqEsWRqhO.DLUoW21cJDV0n6')